backend/tests/load/artillery.yml
# SITREP - Tests de Carga con Artillery
# Ejecutar: npx artillery run tests/load/artillery.yml
# Reporte: npx artillery run --output report.json tests/load/artillery.yml && npx artillery report report.json

config:
  target: "https://sitrep.ultimamilla.com.ar"
  # Para desarrollo local:
  # target: "http://localhost:3011"

  phases:
    # Fase 1: Calentamiento (1 minuto, 5 usuarios/segundo)
    - name: "Warm up"
      duration: 60
      arrivalRate: 5

    # Fase 2: Carga sostenida (2 minutos, 20 usuarios/segundo)
    - name: "Sustained load"
      duration: 120
      arrivalRate: 20

    # Fase 3: Pico de carga (1 minuto, 50 usuarios/segundo)
    - name: "Peak load"
      duration: 60
      arrivalRate: 50

    # Fase 4: Enfriamiento (30 segundos, 10 usuarios/segundo)
    - name: "Cool down"
      duration: 30
      arrivalRate: 10

  # Variables de entorno para autenticación
  variables:
    baseUrl: "https://sitrep.ultimamilla.com.ar"

  # Plugins para métricas adicionales
  plugins:
    expect: {}

  # Configuración de HTTP
  http:
    timeout: 30

  # Procesadores personalizados
  processor: "./processors.js"

# Escenarios de prueba
scenarios:
  # Escenario 1: Flujo de consulta de manifiestos (más común)
  - name: "Consultar manifiestos"
    weight: 40
    flow:
      # Login
      - post:
          url: "/api/auth/login"
          json:
            email: "generador@demo.com"
            password: "demo123"
          capture:
            - json: "$.token"
              as: "authToken"
          expect:
            - statusCode: 200

      # Obtener dashboard stats
      - get:
          url: "/api/manifiestos/dashboard"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200

      # Listar manifiestos
      - get:
          url: "/api/manifiestos?page=1&limit=10"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200

  # Escenario 2: Sincronización offline (transportistas)
  - name: "Sync offline transportista"
    weight: 30
    flow:
      # Login como transportista
      - post:
          url: "/api/auth/login"
          json:
            email: "transportista@demo.com"
            password: "demo123"
          capture:
            - json: "$.token"
              as: "authToken"
          expect:
            - statusCode: 200

      # Sync inicial
      - get:
          url: "/api/sync/initial"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200

      # Verificar estado de sync
      - get:
          url: "/api/sync/status"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200

      # Simular upload de operaciones offline
      - post:
          url: "/api/sync/upload"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            operations:
              - type: "UPDATE_LOCATION"
                timestamp: "{{ $timestamp }}"
                data:
                  manifiestoId: "test-id"
                  latitud: -32.8908
                  longitud: -68.8272
                  velocidad: 60

  # Escenario 3: Validación de QR (operadores)
  - name: "Validar QR y recepcion"
    weight: 20
    flow:
      # Login como operador
      - post:
          url: "/api/auth/login"
          json:
            email: "operador@demo.com"
            password: "demo123"
          capture:
            - json: "$.token"
              as: "authToken"
          expect:
            - statusCode: 200

      # Obtener manifiestos esperados
      - get:
          url: "/api/manifiestos/esperados"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200

      # Validar QR
      - post:
          url: "/api/manifiestos/validar-qr"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            qrCode: "https://sitrep.ultimamilla.com.ar/manifiesto/test-id"
          expect:
            - statusCode: 200

  # Escenario 4: Health check (monitoreo)
  - name: "Health check"
    weight: 10
    flow:
      - get:
          url: "/api/health"
          expect:
            - statusCode: 200
            - contentType: "application/json"

# Configuración de reportes
reporting:
  - json:
      file: "report-{{ $timestamp }}.json"
  - console:
      allowEmptyOutput: false